POLYBIUS_SQUARE = {
    'А': '11', 'Б': '12', 'В': '13', 'Г': '14', 'Д': '15', 'Е': '16',
    'Ж': '21', 'З': '22', 'И': '23', 'Й': '24', 'К': '25', 'Л': '26',
    'М': '31', 'Н': '32', 'О': '33', 'П': '34', 'Р': '35', 'С': '36',
    'Т': '41', 'У': '42', 'Ф': '43', 'Х': '44', 'Ц': '45', 'Ч': '46',
    'Ш': '51', 'Щ': '52', 'Ъ': '53', 'Ы': '54', 'Ь': '55', 'Э': '56',
    'Ю': '61', 'Я': '62', ' ': '63'
}

INPUT_FILE = 'input.txt'
ENCRYPTED_FILE = 'encrypted_polybius.txt'
DECRYPTED_FILE = 'decrypted_polybius.txt'
KEY_FILE = 'key_polybius.txt'


"""Константы для лабораторной работы №1"""

# ========== ЗАДАНИЕ 1 ==========
# Квадрат Полибия 6x6
POLYBIUS_SQUARE = {
    'А': '11', 'Б': '12', 'В': '13', 'Г': '14', 'Д': '15', 'Е': '16',
    'Ж': '21', 'З': '22', 'И': '23', 'Й': '24', 'К': '25', 'Л': '26',
    'М': '31', 'Н': '32', 'О': '33', 'П': '34', 'Р': '35', 'С': '36',
    'Т': '41', 'У': '42', 'Ф': '43', 'Х': '44', 'Ц': '45', 'Ч': '46',
    'Ш': '51', 'Щ': '52', 'Ъ': '53', 'Ы': '54', 'Ь': '55', 'Э': '56',
    'Ю': '61', 'Я': '62', ' ': '63'
}

INPUT_FILE = 'input.txt'
ENCRYPTED_FILE = 'encrypted_polybius.txt'
DECRYPTED_FILE = 'decrypted_polybius.txt'
KEY_FILE = 'key_polybius.txt'


ENCRYPTED_TEXT = """КwЧ5Д>ЫХЧ1ЪЕt Й2>ХИЬЧЙ ФХ 1 ХБЧБХЫПЫХЪЕЩЕtФЙХБЕ2rtЫИИ ХrЕЯЩЕ1ФУЙХДЫХЙЕ17БЕХ8ЛЛЫБЙ
ЩДЕХМtЧД Й7ХБЕДЛ wЫД4 Ч17Д>ЫХwЧДД>ЫХДЕХ ХДЧrt
2ЫtХЯДЧ5 ЙЫ17ДЕХК2ЫД7О
Й7ХtЧЯ2ЫtХrtЕЪtЧ22>ХБЕЙЕtКУХЯЧХЕw ДХrt
Ы2Х2ЕЬДЕХЯЧЪtКЯ Й7ХЩХrЧ2ФЙ7Х Х ИrЕ1Д
Й7ХИКПЫИЙЩКЫЙХДЫХ2ЫД7ОЫХwУЬ Д>ХtЧЯ1
5Д>МХКrЧБЕЩП БЕЩХ ИrЕ1Д 2>МХЛЧА1ЕЩХДЫБЕЙЕt>ЫХ
ЯХД МХИЕwЫtЬЧЙХtЫЧ1 ЯЧ4 ХЧ1ЪЕt Й2ЕЩХО ЛtЕЩЧД
ФХИХ4Ы17УХКИ1ЕЬД Й7ХЬ ЯД7ХrЕЙЫД4
Ч17Д>2ХМЧБЫtЧ2ХДЕХД ХЩХЕwДЕАХ ЯХД МХЧ1ЪЕt Й2ХО
ЛtЕЩЧД ФХД БЧБХДЫХИЩФЯЧДХИХЧ1ЪЕt Й2Е2ХИЬЧЙ ФХЕД
ХtЫЧ1 ЯЕЩЧД>ХБЧБХЕЙwЫ17Д>ЫХЧ1ЪЕt Й2>Х Х
ИrЕ17ЯКУЙИФХtЧЯwЫ17ДЕ"""

DECRYPTION_KEY = {
    ' ': 'И',    'Х': ' ',    'Б': 'К',    'Ы': 'Е',
    'Ч': 'А',    'Е': 'О',    'Д': 'Н',    'Й': 'Т',
    '1': 'Л',    't': 'Р',    '2': 'М',    'И': 'С',
    'Я': 'З',    '7': 'Ь',    'Щ': 'В',    '>': 'Ы',
    'К': 'У',    'Ф': 'Я',    'w': 'Д',    'Ъ': 'Г',
    'Ь': 'Ж',    'Л': 'Ф',    'М': 'Х',    'r': 'П',
    'У': 'Ю',    '4': 'Ц',    'О': 'Ш',    '5': 'Ч',
    'П': 'Щ',    'X': 'Й',    'З': 'В',    'Т': 'Э',
    'А': 'Й',    '-': '-',    '8': 'Э',    '\n': 'И'
}

ENCRYPTED_VARIANT_FILE = '02_encrypted_variant.txt'
DECRYPTED_RESULT_FILE = '02_decrypted.txt'
KEY_FOUND_FILE = '02_key_found.txt'
FREQUENCY_FILE = '02_frequency_analysis.txt'

RUSSIAN_FREQ = {
    'О': 9.28, 'И': 8.67, 'Е': 8.10, 'А': 7.80, 'Н': 6.70,
    'Т': 6.30, 'С': 5.50, 'Р': 4.80, 'В': 4.60, 'Л': 4.30
}