cipher_text = """tАЪЧХАЫ151Ъ1ХЯ Ч<tЫФБ7Х1ЪЕЬ ЧБ<ХЩ ЧЯБЬЕ 1ЛЧ5tАЩЬЕЬХЯ tЬ2
1ЙЬД1ЫЧФХr1ЫЫ>МХБЬХЬЩ1ИtБАФХ5БЬХ1ЪЕЬ
ЧБ<ХАИ1БЧФХЫtХ<ЬИtБХ8ЛЛtЩБЧДЫЬХ 12ЬБ1Б7ХЫ1ХОЧЛ
ЬБtЩАБ1МХМЬ ЬОЧМХЩ ЧЯБЬ1ЪЕЬ ЧБ<ЬДХАИ1Б7ХОЧЛ
ЬБtЩАБХДtА7<1ХБФИtЪЬХЯЬХБЬШХЯ ЬАБЬШХЯ Ч5ЧЫtХ5БЬХЩ ЧЯБЬЕ
1ЛЧ5tАЩ1ФХАЧАБt<1ХrЬЪИЫ1ХЪУ2><ЧХrЬАБКЯЫ><ЧХАЯЬАЬ21<ЧХ
ЧЙ21ДЪФБ7ХОЧЛ ЬБtЩАБХЬБХЬ5tДЧrЫ>МХДЫКБ
tЫЫЧМХЙ1ДЧАЧ<ЬАБtШХ1ХЯЬБЬ<КХtЕЬХ8ЫБ
ЬЯЧФХ2КrtБХДtА7<1ХД>АЬЩЬШХЧХКИХБЬ5ЫЬХЫ1<ЫЬЕЬХД>ОtХ5t<
ХКХЬБЩ >БЬЕЬХБtЩАБ1ХЯ trАБ1ДЧБ7ХАt2tХ1ЪЕЬ
ЧБ<ХАИ1БЧФХЩЬБЬ >ШХ2>ХМЬ
ЬОЬХАИЧ<1ЪХЙ1ОК<ЪtЫЫ>tХr1ЫЫ>tХrЬДЬЪ7ЫЬХБФИtЪЬХДtr7Хr1Иt
ХЧЫБКЧБЧДЫЬХЯЬЫФБЫЬХ5БЬХАИ1БЧtХДАt4tЪЬХ21ЙЧ
КtБАФХЫ1ХЧЙ2>БЬ5ЫЬАБЧХЧЫЛЬ <14ЧЧХДХБtЩАБtХОЧЛ
ЬД1ЫЧtХ8БКХЧЙ2>БЬ5ЫЬАБ7ХКАБ 1ЫФtБХ1ХД<tАБtХАХЫtШХКАБ
1ЫФtБХЧХДЬЙ<ЬИЫЬАБ7ХАИ1Б7ХБtЩАБ"""

decrypt_key = {
    '1': 'а', '2': 'б', 'Д': 'в', 'Е': 'г', 'r': 'д', 't': 'е', 
    'И': 'ж', 'Й': 'з', 'Ч': 'и', 'Ш': 'й', 'Щ': 'к', 'Ъ': 'л', 
    '<': 'м', 'Ы': 'н', 'Ь': 'о', 'Я': 'п', ' ': 'р', 'А': 'с', 
    'Б': 'т', 'К': 'у', 'Л': 'ф', 'М': 'х', '4': 'ц', '5': 'ч', 
    'О': 'ш', '8': 'э', 'У': 'ю', 'Ф': 'я', '7': 'ь', '>': 'ы', 
    'Х': ' ', '\n': 'р'
}

plain_text = ""

for char in cipher_text:
    plain_text += decrypt_key.get(char, char)

print(plain_text)